#                                                           Проверка ДЗ(интересные альтернативные решения)
# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# num=int(input('Write day of week '))
# if num in(6,7):
#     print('hollydays')
# elif num in (1,2,3,4,5):
#     print('work day')
# else:
#     print('try agaim')

# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# ⋀-and
# ⋁-or
# ¬-not

# for x in[True,False]:
#     for y in [True, False]:
#         for z in [True, False]:
#             print(f'x={x} y={y} z={z}', end='->')
#             print( not(x and y and z)==(not x) or (not y) or (not z))
# #                 result='Верно'
# #             else:
# #                 result='Ложно'
# # print(result)

# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
print('диаопозон для x и y')
values=['x > 0 y < 0', 'x < 0 y > )', 'x < 0 y < 0', 'x > 0 y < 0']
