#                                                       ВВОД - ВЫВОД, ОПРЕАТОРЫ ВЕТВЛЕНИЯ
# Задача №1. 
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
# n=700 // m=750

n=700
m=750

print(n//m)